#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/davinci/aws-genai-pii-protection/runs/run-EKtpC1misjpNSzrU

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda: Refreshing...
data.archive_file.macie_status: Refreshing...
data.archive_file.macie_findings: Refreshing...
data.archive_file.macie_xfer_clean: Refreshing...
data.archive_file.macie_xfer_sensitive: Refreshing...
data.archive_file.macie_scan: Refreshing...
data.archive_file.macie_findings: Refresh complete after 0s [id=13a9784686f9ceb1843eb694903ba209fbd2686a]
data.archive_file.macie_status: Refresh complete after 0s [id=0f2420cd31b45cdc9c682307395f6b9feac253b9]
data.archive_file.lambda: Refresh complete after 0s [id=5f1a595e2984526f1ae2da0237049d007125ce83]
data.archive_file.macie_xfer_clean: Refresh complete after 0s [id=de2141f5f5da31b6121cea85ded63597a71d6d29]
data.archive_file.macie_xfer_sensitive: Refresh complete after 0s [id=25fcace3e539a2441bd4c876f33d62985a4427cd]
data.archive_file.macie_scan: Refresh complete after 0s [id=cead8b7b929c8985dc7c5e65f7ec584bde2e8713]
aws_cloudwatch_metric_alarm.macie_scan: Refreshing state... [id=macie_scan-lambda-error]
aws_sns_topic.macie_scan: Refreshing state... [id=arn:aws:sns:us-east-1:288195736164:macie_scan_failure_topic]
aws_s3_bucket.raw: Refreshing state... [id=raw20250617121549564000000004]
data.aws_iam_policy_document.assume_role_events: Refreshing...
aws_cloudwatch_log_group.macie_scan: Refreshing state... [id=/aws/lambda/macie_scan]
aws_s3_bucket.scan: Refreshing state... [id=scan20250617121549563600000003]
data.aws_region.current: Refreshing...
aws_cloudwatch_log_group.step_function_id: Refreshing state... [id=/aws/lambda/step_function_stdout]
aws_cloudwatch_log_group.macie_xfer_sensitive: Refreshing state... [id=/aws/lambda/macie_xfer_sensitive]
data.aws_iam_policy_document.assume_role_events: Refresh complete after 0s [id=3959961479]
data.aws_region.current: Refresh complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.macie_xfer_clean: Refreshing state... [id=/aws/lambda/macie_xfer_clean]
aws_cloudwatch_log_group.macie_findings: Refreshing state... [id=/aws/lambda/macie_findings]
aws_s3_bucket.sensitive: Refreshing state... [id=sensitive20250617121549561300000001]
aws_cloudwatch_log_group.macie_status: Refreshing state... [id=/aws/lambda/macie_status]
aws_macie2_account.this: Refreshing state... [id=288195736164]
aws_s3_bucket.clean: Refreshing state... [id=clean20250617121549562500000002]
data.aws_caller_identity.current: Refreshing...
data.aws_iam_policy_document.assume_step_functions: Refreshing...
data.aws_iam_policy_document.assume_lambda: Refreshing...
data.aws_iam_policy_document.assume_step_functions: Refresh complete after 0s [id=4022981484]
data.aws_iam_policy_document.assume_lambda: Refresh complete after 0s [id=2690255455]
data.aws_caller_identity.current: Refresh complete after 0s [id=288195736164]
aws_iam_role.events: Refreshing state... [id=events]
aws_sns_topic_subscription.macie_scan: Refreshing state... [id=arn:aws:sns:us-east-1:288195736164:macie_scan_failure_topic:a881f8e8-11c4-45e3-9670-bce82030ef05]
aws_iam_role.step: Refreshing state... [id=step_functions]
aws_iam_role.lambda_macie: Refreshing state... [id=lambda_macie]
aws_cloudwatch_event_rule.raw_bucket_objects: Refreshing state... [id=capture-objects-created]
aws_s3_bucket_notification.raw_bucket_notification: Refreshing state... [id=raw20250617121549564000000004]
aws_s3_object.txt_file: Refreshing state... [id=foo.txt]
aws_sfn_state_machine.sfn_state_machine: Refreshing state... [id=arn:aws:states:us-east-1:288195736164:stateMachine:pii-macie-scanner-state-machine]
aws_lambda_function.step_function_id: Refreshing state... [id=step_function_stdout]
aws_lambda_function.macie_findings: Refreshing state... [id=macie_findings]
aws_lambda_function.macie_xfer_sensitive: Refreshing state... [id=macie_xfer_sensitive]
aws_lambda_function.macie_scan: Refreshing state... [id=macie_scan]
aws_lambda_function.macie_status: Refreshing state... [id=macie_status]
aws_lambda_function.macie_xfer_clean: Refreshing state... [id=macie_xfer_clean]
data.aws_iam_policy_document.lambda_macie: Refreshing...
data.aws_iam_policy_document.lambda_macie: Refresh complete after 0s [id=3502490696]
aws_iam_policy.lambda_macie: Refreshing state... [id=arn:aws:iam::288195736164:policy/lambda_s3_macie_scan]
aws_iam_role_policy_attachment.lambda_macie: Refreshing state... [id=lambda_macie-20250617160659465300000001]
data.aws_iam_policy_document.step_function_execute: Refreshing...
aws_cloudwatch_event_target.step_function: Refreshing state... [id=capture-objects-created-StepFunctionTrigger]
data.aws_iam_policy_document.step_function_execute: Refresh complete after 0s [id=3665501812]
aws_iam_policy.step_function_execute: Refreshing state... [id=arn:aws:iam::288195736164:policy/step_functions_execute_policy]
aws_iam_role_policy_attachment.step_function_execute: Refreshing state... [id=events-20250617222249641500000001]
aws_lambda_permission.allow_raw_bucket: Refreshing state... [id=AllowExecutionFromRaw3Bucket]
data.aws_iam_policy_document.step: Refreshing...
data.aws_iam_policy_document.step: Refresh complete after 0s [id=1790917436]
aws_iam_policy.step: Refreshing state... [id=arn:aws:iam::288195736164:policy/step_functions_policy]
aws_iam_role_policy_attachment.step: Refreshing state... [id=step_functions-20250617183116945600000001]
aws_s3_object.txt_file: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.step_function_failure will be created
  + resource "aws_cloudwatch_event_rule" "step_function_failure" {
      + arn            = (known after apply)
      + description    = "Capture S3 Objects Created"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + stateMachineArn = [
                      + "arn:aws:states:us-east-1:288195736164:stateMachine:pii-macie-scanner-state-machine",
                    ]
                  + status          = [
                      + "FAILED",
                      + "TIMED_OUT",
                    ]
                }
              + detail-type = [
                  + "Step Functions Execution Status Change",
                ]
              + source      = [
                  + "aws.states",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "capture-objects-created"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "GitHubRepo" = "aws-genai-pii-protection"
          + "Workspace"  = "aws-genai-pii-protection"
        }
    }

  # aws_cloudwatch_metric_alarm.macie_scan will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "macie_scan" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:288195736164:macie_scan_failure_topic",
        ] -> null
      - alarm_description                     = "Lambda Errored Out" -> null
      - alarm_name                            = "macie_scan-lambda-error" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:288195736164:alarm:macie_scan-lambda-error" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "FunctionName" = "macie_scan"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "macie_scan-lambda-error" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "Errors" -> null
      - namespace                             = "AWS/Lambda" -> null
      - ok_actions                            = [] -> null
      - period                                = 60 -> null
      - statistic                             = "Maximum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "GitHubRepo" = "aws-genai-pii-protection"
          - "Workspace"  = "aws-genai-pii-protection"
        } -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.txt_file will be created
  + resource "aws_s3_object" "txt_file" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "raw20250617121549564000000004"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "foo.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./foo.txt"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "GitHubRepo" = "aws-genai-pii-protection"
          + "Workspace"  = "aws-genai-pii-protection"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 1 of 3 estimated
           $0.0/mo -$0.30000000000000024

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jmeisele, Action: `pull_request`*